import numpy as np

global m
m = np.array([1, 1, 0, 1])  # 1001001010101010101101010111 - 4 и 32 бита
z = np.array([[1], [0], [0], [1], [0], [1], [1]])  # в будущем рандом

G_revers = np.array([[1, 0, 0, 0],
                     [0, 1, 0, 0],
                     [0, 0, 1, 0],
                     [0, 0, 0, 1],
                     [1, 1, 0, 1],
                     [1, 0, 1, 1],
                     [0, 1, 1, 1]])  # not correct

global G
G = np.array([[1, 0, 0, 0, 1, 1, 0],
              [0, 1, 0, 0, 1, 0, 1],
              [0, 0, 1, 0, 0, 1, 1],
              [0, 0, 0, 1, 1, 1, 1]])  # correct

U = np.array([1, 0, 1, 0])
U_reverse = np.array([[1], [0], [1], [0]])
